org/ipe.org
* Export configuration                                             :noexport:

  #+SETUPFILE: org-settings.org
  #+TITLE:     Inversion point encoded binary arrays --- ~ipe.org~
  #+AUTHOR:    Jaakko Järvi
  #+EMAIL:     jarvij@gmail.com
  #+DATE:      


* Introduction

  \( 
  \newcommand{\true}{\mathsf{true}} 
  \newcommand{\false}{\mathsf{false}}
  \newcommand{\selset}{{\mathbf{2}}}
  \newcommand{\esp}[2]{\mathsf{op}^{#1}_{#2}} 
  \newcommand{\ipe}{\mathsf{ipe}}
  \newcommand{\inds}{\mathsf{s\_dom}}
  \) 
  This document describes a form or run-length encoding for
  binary arrays. This encoding stores the /inversion points/,
  the indices where each run of zeroes or ones starts.

  Let $\Sigma$ be a finite alphabet.  Then $s = (s_0, s_1, \ldots,
  s_{n-1}) \in \Sigma^n$ is a sequence whose length is $n$.  We assume
  zero-based indexing throughout this document.  Any two indices $b$
  and $e$, where $0 \leq b \leq e < n$, denote a contigous subsequence
  $s_{b, e} = (s_b, s_{b+1}, \ldots, s_{e-1})$. The length of the
  subsequence is $b-e$.

  We call a contiguous subsequence $s_{b, e}$ a /run/ of value $v$,
  and denote it as $(v, b, e)$, if 
   
    - $\forall i \in [b, e), s_i = v$;
    - $b = 0 \vee s_{b-1} \neq v$; and
    - $e = n \vee s_{e-1} \neq v$.
 
  A run is non-empty if $e > b$.

  The $n$-element sequence $s$ can be encoded as a sequence of
  consequtive runs $(v_0, b_0, e_0), (v_1, b_1, e_1), \ldots (v_k,
  b_k, e_k)$, where $b_0 = 0$, $e_k = n$, and $\forall i < n. e_i =
  b_i$.  We do not insist that runs are non-empty.

  Since the next run starts from where the previous run ends, it
  suffices to only store the start indices, or alternatively lengths,
  of each run. We use an encoding that stores the start indices. In
  this case, the length of the last run is not defined, but can be
  determined if the length of the sequence $s$ is known.

  If the alphabet is binary, only the first run's value
  must be stored: the value of every other run is determined by the
  value of the run that precedes it.  A binary sequence can thus be
  encoded as a sequence of start indices of runs, that is, points 
  where the sequence's value inverts.

  *Definition* Let $s$ be an $n$-element binary sequence, and $(v_0,
  0, r_0), (v_1, r_0, r_1), \ldots (v_k, r_k, n)$ its encoding as
  consequtive runs. Then $s$'s /inversion point encoding/, we shorten it as
  $\ipe$, is defined as follows:

    \begin{equation*}
    \ipe(s) =
    \left\{ 
      \begin{array}{ll} 
        r_0, r_1, \ldots, r_k & \text{if}\ v_0 = 0, v_k = 0\\
        0, r_0, r_1, \ldots, r_k & \text{if}\ v_0 = 1, v_k = 0\\
        r_0, r_1, \ldots, r_k, n & \text{if}\ v_0 = 0, v_k = 1\\
        0, r_0, r_1, \ldots, r_k, n & \text{if}\ v_0 = 1, v_k = 1\\
      \end{array}
    \right.
    \end{equation*}

  The $\ipe$ is thus the sequence of the starting indices of the runs,
  prefixed with $0$ if the first run's value is $0$, and postfixed
  with $n$ if the last run's value is $1$.

  *Example 1* The ipe of $0, 0, 1, 1, 0$ is $2, 3$.

  *Example 2* The ipe of $1, 1$ is $0, 2$.

  *Example 3* The ipe of the empty sequence is the empty sequence.

  *Example 4* The ipe of $0, 0, 0, 0$ is the empty sequence.

  *Remark 1* Inversion point encoding of any binary sequence  
  has an even number of elements.

  *Remark 2* Inversion point encoding is not injective.
  Two binary sequences of different lenghts that only differ
  in the number of zeroes at the end of the sequences have the same $\ipe$.

  Thus, to compute the orignal sequence from its $\ipe$ requires
  knowing the length of the sequence. 

  We could choose to consider an inversion point encoding to represent
  infinite binary sequences, where the last run (of zeroes) is considered to 
  continue indefinitely. Similarly, we could consider the
  sequence to extend to negative indices and assume that the first run up to the
  first inversion point extends indefinitely towards negative infinity.
  Since we assume that the first inversion point start a run of 1s, 
  and that there are an even number of inversion points, an $\ipe$ sequence
  always describes a binary sequence that contains a finite number of 1s.
  

* Utility functions

#+NAME: utilities
#+BEGIN_SRC js :noweb yes :exports none
<<array-utilities>>
<<array-lower-bound>>
<<array-upper-bound>>
#+END_SRC

** Array utilities

#+NAME: array-utilities
#+BEGIN_SRC js :noweb strip-export
function push_n(arr, v, n) { for (var i=0; i<n; ++i) arr.push(v); }
#+END_SRC

- Pushes ~v~ to ~arr~ ~n~ times.

** Lower bound in an array

- /Precondition:/ ~array~ is sorted in ascending order.
- /Result:/ The first index ~i~ such that ~!(array[i] < value)~.
  If such an index does not exist, returns ~array.length~.

#+NAME: array-lower-bound
#+BEGIN_SRC js
  function array_lower_bound(array, value) {
    var first = 0, last = array.length; // last is past-the-end
    var i, count, step;
    count = last - first;
  
    while (count > 0) {
      i = first; 
      step = Math.floor(count / 2); 
      i += step;
      if (array[i] < value) {
        first = ++i; 
        count -= step + 1; 
      } else {
        count = step;
      }
    }
    return first;
  }
#+END_SRC

