org/ipe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-30 Fri 15:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inversion point encoded binary arrays &#x2014; <code>ipe.org</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jaakko Järvi Jaakko Järvi" />
</head>
<body>
<div id="content">
<h1 class="title">Inversion point encoded binary arrays &#x2014; <code>ipe.org</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4ff165">1. Introduction</a></li>
<li><a href="#org69fdb32">2. Utility functions</a>
<ul>
<li><a href="#orgef18cd2">2.1. Array utilities</a></li>
<li><a href="#orgec33a8e">2.2. Lower bound in an array</a></li>
<li><a href="#org110a231">2.3. Upper bound in an array</a></li>
</ul>
</li>
<li><a href="#orgc672003">3. Inversion point encoded binary arrays</a>
<ul>
<li><a href="#org265ee92">3.1. Encoding and decoding ipe binary arrays</a></li>
<li><a href="#org00b069c">3.2. Constructing special ipe-sequences</a></li>
<li><a href="#orgc0be15e">3.3. Applying a unary logical operation to an ipe-sequence within a mask</a></li>
<li><a href="#orgdd9332f">3.4. Retrieving an element in an ipe-sequence</a></li>
</ul>
</li>
<li><a href="#orge8c40f7">4. Selection Storage with Ipe Binary Arrays</a></li>
<li><a href="#org425da7c">5. Example Selection Geometry</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc4ff165" class="outline-2">
<h2 id="orgc4ff165"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
\( 
  \newcommand{\true}{\mathsf{true}} 
  \newcommand{\false}{\mathsf{false}}
  \newcommand{\selset}{{\mathbf{2}}}
  \newcommand{\esp}[2]{\mathsf{op}^{#1}_{#2}} 
  \newcommand{\ipe}{\mathsf{ipe}}
  \newcommand{\inds}{\mathsf{s\_dom}}
  \) 
This document describes a form or run-length encoding for
binary arrays. This encoding stores the <i>inversion points</i>,
the indices where each run of zeroes or ones starts.
</p>

<p>
Let \(\Sigma\) be a finite alphabet.  Then \(s = (s_0, s_1, \ldots,
  s_{n-1}) \in \Sigma^n\) is a sequence whose length is \(n\).  We assume
zero-based indexing throughout this document.  Any two indices \(b\)
and \(e\), where \(0 \leq b \leq e < n\), denote a contigous subsequence
\(s_{b, e} = (s_b, s_{b+1}, \ldots, s_{e-1})\). The length of the
subsequence is \(b-e\).
</p>

<p>
We call a contiguous subsequence \(s_{b, e}\) a <i>run</i> of value \(v\),
and denote it as \((v, b, e)\), if 
</p>

<ul class="org-ul">
<li>\(\forall i \in [b, e), s_i = v\);</li>
<li>\(b = 0 \vee s_{b-1} \neq v\); and</li>
<li>\(e = n \vee s_{e-1} \neq v\).</li>
</ul>

<p>
A run is non-empty if \(e > b\).
</p>

<p>
The $n$-element sequence \(s\) can be encoded as a sequence of
consequtive runs \((v_0, b_0, e_0), (v_1, b_1, e_1), \ldots (v_k,
  b_k, e_k)\), where \(b_0 = 0\), \(e_k = n\), and \(\forall i < n. e_i =
  b_i\).  We do not insist that runs are non-empty.
</p>

<p>
Since the next run starts from where the previous run ends, it
suffices to only store the start indices, or alternatively lengths,
of each run. We use an encoding that stores the start indices. In
this case, the length of the last run is not defined, but can be
determined if the length of the sequence \(s\) is known.
</p>

<p>
If the alphabet is binary, only the first run&rsquo;s value
must be stored: the value of every other run is determined by the
value of the run that precedes it.  A binary sequence can thus be
encoded as a sequence of start indices of runs, that is, points 
where the sequence&rsquo;s value inverts.
</p>

<p>
<b>Definition</b> Let \(s\) be an $n$-element binary sequence, and \((v_0,
  0, r_0), (v_1, r_0, r_1), \ldots (v_k, r_k, n)\) its encoding as
consequtive runs. Then \(s\)&rsquo;s <i>inversion point encoding</i>, we shorten it as
\(\ipe\), is defined as follows:
</p>

\begin{equation*}
\ipe(s) =
\left\{ 
  \begin{array}{ll} 
    r_0, r_1, \ldots, r_k & \text{if}\ v_0 = 0, v_k = 0\\
    0, r_0, r_1, \ldots, r_k & \text{if}\ v_0 = 1, v_k = 0\\
    r_0, r_1, \ldots, r_k, n & \text{if}\ v_0 = 0, v_k = 1\\
    0, r_0, r_1, \ldots, r_k, n & \text{if}\ v_0 = 1, v_k = 1\\
  \end{array}
\right.
\end{equation*}

<p>
The \(\ipe\) is thus the sequence of the starting indices of the runs,
prefixed with \(0\) if the first run&rsquo;s value is \(0\), and postfixed
with \(n\) if the last run&rsquo;s value is \(1\).
</p>

<p>
<b>Example 1</b> The ipe of \(0, 0, 1, 1, 0\) is \(2, 3\).
</p>

<p>
<b>Example 2</b> The ipe of \(1, 1\) is \(0, 2\).
</p>

<p>
<b>Example 3</b> The ipe of the empty sequence is the empty sequence.
</p>

<p>
<b>Example 4</b> The ipe of \(0, 0, 0, 0\) is the empty sequence.
</p>

<p>
<b>Remark 1</b> Inversion point encoding of any binary sequence  
has an even number of elements.
</p>

<p>
<b>Remark 2</b> Inversion point encoding is not injective.
Two binary sequences of different lenghts that only differ
in the number of zeroes at the end of the sequences have the same \(\ipe\).
</p>

<p>
Thus, to compute the orignal sequence from its \(\ipe\) requires
knowing the length of the sequence. 
</p>

<p>
We could choose to consider an inversion point encoding to represent
infinite binary sequences, where the last run (of zeroes) is considered to 
continue indefinitely. Similarly, we could consider the
sequence to extend to negative indices and assume that the first run up to the
first inversion point extends indefinitely towards negative infinity.
Since we assume that the first inversion point start a run of 1s, 
and that there are an even number of inversion points, an \(\ipe\) sequence
always describes a binary sequence that contains a finite number of 1s.
</p>
</div>
</div>


<div id="outline-container-org69fdb32" class="outline-2">
<h2 id="org69fdb32"><span class="section-number-2">2</span> Utility functions</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgef18cd2" class="outline-3">
<h3 id="orgef18cd2"><span class="section-number-3">2.1</span> Array utilities</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-js" id="orgd4e4704"><span style="color: #0000FF;">function</span> <span style="color: #006699;">push_n</span>(<span style="color: #BA36A5;">arr</span>, <span style="color: #BA36A5;">v</span>, <span style="color: #BA36A5;">n</span>) { <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>=0; i&lt;n; ++i) arr.push(v); }
</pre>
</div>

<ul class="org-ul">
<li>Pushes <code>v</code> to <code>arr</code> <code>n</code> times.</li>
</ul>
</div>
</div>

<div id="outline-container-orgec33a8e" class="outline-3">
<h3 id="orgec33a8e"><span class="section-number-3">2.2</span> Lower bound in an array</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><i>Precondition:</i> <code>array</code> is sorted in ascending order.</li>
<li><i>Result:</i> The first index <code>i</code> such that <code>!(array[i] &lt; value)</code>.
If such an index does not exist, returns <code>array.length</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js" id="orgfcf1cfe">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">array_lower_bound</span>(<span style="color: #BA36A5;">array</span>, <span style="color: #BA36A5;">value</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">first</span> = 0, <span style="color: #BA36A5;">last</span> = array.length; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">last is past-the-end</span>
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>, <span style="color: #BA36A5;">count</span>, <span style="color: #BA36A5;">step</span>;
    count = last - first;
  
    <span style="color: #0000FF;">while</span> (count &gt; 0) {
      i = first; 
      step = Math.floor(count / 2); 
      i += step;
      <span style="color: #0000FF;">if</span> (array[i] &lt; value) {
        first = ++i; 
        count -= step + 1; 
      } <span style="color: #0000FF;">else</span> {
        count = step;
      }
    }
    <span style="color: #0000FF;">return</span> first;
  }
</pre>
</div>
</div>
</div>
