org/ipe.org
** Upper bound in an array

- /Precondition:/ ~array~ is sorted in ascending order.
- /Result:/ The first index ~i~ such that ~array[i] > value~.
  If such an index does not exist, returns ~array.length~.

#+NAME: array-upper-bound
#+BEGIN_SRC js 
  function array_upper_bound(array, value) {
    var first = 0, last = array.length;
    var i, count, step;
    count = last - first;
 
    while (count > 0) {
      i = first; 
      step = Math.floor(count / 2);
      i += step;
      if (!(value < array[i])) {
        first = ++i;
        count -= step + 1;
      } else {
        count = step;
      }
    }
    return first;
  }
#+END_SRC

#+NAME: array-lower-bound-test
#+BEGIN_SRC js :exports none
  QUnit.test( "array_lower_bound", function( assert ) {
    assert.equal(array_lower_bound([], 1), 0, "lower bound in empty array");
    assert.equal(array_lower_bound([0], 1), 1, "one element less");
    assert.equal(array_lower_bound([1], 1), 0, "one element equal");
    assert.equal(array_lower_bound([2], 1), 0, "one element greater");

    assert.equal(array_lower_bound([2,4], 0), 0, "less than first");
    assert.equal(array_lower_bound([2,4], 2), 0, "equal to first");
    assert.equal(array_lower_bound([2,4], 3), 1, "between");
    assert.equal(array_lower_bound([2,4], 4), 1, "equal to second");
    assert.equal(array_lower_bound([2,4], 5), 2, "greater than second");

    assert.equal(array_lower_bound([2,4,4,5], 3), 1);
    assert.equal(array_lower_bound([2,4,4,5], 4), 1);
    assert.equal(array_lower_bound([2,4,4,5], 5), 3);
    assert.equal(array_lower_bound([2,4,4,5], 6), 4);
  });
#+END_SRC

#+NAME: array-upper-bound-test
#+BEGIN_SRC js :exports none
  QUnit.test( "array_upper_bound", function( assert ) {
    assert.equal(array_upper_bound([], 1), 0, "upper bound in empty array");
    assert.equal(array_upper_bound([0], 1), 1, "one element less");
    assert.equal(array_upper_bound([1], 1), 1, "one element equal");
    assert.equal(array_upper_bound([2], 1), 0, "one element greater");

    assert.equal(array_upper_bound([2,4], 0), 0, "less than first");
    assert.equal(array_upper_bound([2,4], 2), 1, "equal to first");
    assert.equal(array_upper_bound([2,4], 3), 1, "between");
    assert.equal(array_upper_bound([2,4], 4), 2, "equal to second");
    assert.equal(array_upper_bound([2,4], 5), 2, "greater than second");

    assert.equal(array_upper_bound([2,4,4,5], 3), 1);
    assert.equal(array_upper_bound([2,4,4,5], 4), 3);
    assert.equal(array_upper_bound([2,4,4,5], 5), 4);
    assert.equal(array_upper_bound([2,4,4,5], 6), 4);
  });
#+END_SRC

* Inversion point encoded binary arrays

This library provides a minimal implementation of ipe-sequences as arrays.
The goal is for the API to be sufficient for the needs of
{{{msjs}}}.

# serve multiselection, not a general 
# We represent binary sequences as arrays of booleans, and call them
# binary arrays.  Ipe-sequences are represented as arrays of
# non-negative integers. 

** Encoding and decoding ipe binary arrays

The following two functions handle
the encoding and decoding of ipe-sequences.

#+NAME: ipe-encode
#+BEGIN_SRC js
  function ipe_encode(arr) {
    var s = false, seq = [];
    var i;
    for (i = 0; i < arr.length; ++i) {
      if (arr[i] !== s) { seq.push(i); s = !s; }
    }
    if (s) seq.push(i);
    return seq;
  }
#+END_SRC

- ~arr~ is an array of ~bool~ values.
- Returns an inversion point encoded sequence of ~arr~.

#+NAME: ipe-decode
#+BEGIN_SRC js
  function ipe_decode(seq) {
    var arr = []; 
    var s = false;
    var pind = 0;
    for (var i = 0; i < seq.length; ++i) {
      push_n(arr, s, seq[i] - pind);
      pind = seq[i];
      s = !s;
    }
    return arr;
  }
#+END_SRC

- ~seq~ is an inversion point encoded sequence.
- Returns the shortest binary array whose inversion point encoding is
  ~seq~.  The requirement for the shortest array means that there are
  no zero-element runs.
  
#+NAME: ipe-encode-decode-test
#+BEGIN_SRC js :exports none
  QUnit.test( "ipe_encode_decode_test", function( assert ) {
    var enc = ipe_encode, dec = ipe_decode;
    assert.deepEqual(dec(enc([])), [], "");

    var f = false, t = true;
    var arrs = [
      [], [t], [t, t], [f, f], 
      [f, t], [t, t, f], [f, t, f, t],
      [f, f, t, t, f, t, t, t, f, f]
    ];

    function drop_false_suffix(arr) { 
      var b = arr.slice();
      while (b.length > 0 && b[b.length-1] === f) b.pop(); 
      return b; 
    }

    for (var i=0; i<arrs.length; ++i) {
      assert.deepEqual(dec(enc(arrs[i])), drop_false_suffix(arrs[i]), "loop"+i);
    }
  });
#+END_SRC

** Constructing special ipe-sequences

Construct an array with a single block of 1s:

#+NAME: ipe-encode-range
#+BEGIN_SRC js
  function ipe_encode_range(b, e) { return [b, e]; }
#+END_SRC

- ~b~ is the first index of the run
- ~e~ is one past the last index of the run

