org/ipe.html

<div id="outline-container-org110a231" class="outline-3">
<h3 id="org110a231"><span class="section-number-3">2.3</span> Upper bound in an array</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><i>Precondition:</i> <code>array</code> is sorted in ascending order.</li>
<li><i>Result:</i> The first index <code>i</code> such that <code>array[i] &gt; value</code>.
If such an index does not exist, returns <code>array.length</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js" id="orgd83249d">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">array_upper_bound</span>(<span style="color: #BA36A5;">array</span>, <span style="color: #BA36A5;">value</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">first</span> = 0, <span style="color: #BA36A5;">last</span> = array.length;
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>, <span style="color: #BA36A5;">count</span>, <span style="color: #BA36A5;">step</span>;
    count = last - first;
 
    <span style="color: #0000FF;">while</span> (count &gt; 0) {
      i = first; 
      step = Math.floor(count / 2);
      i += step;
      <span style="color: #0000FF;">if</span> (!(value &lt; array[i])) {
        first = ++i;
        count -= step + 1;
      } <span style="color: #0000FF;">else</span> {
        count = step;
      }
    }
    <span style="color: #0000FF;">return</span> first;
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc672003" class="outline-2">
<h2 id="orgc672003"><span class="section-number-2">3</span> Inversion point encoded binary arrays</h2>
<div class="outline-text-2" id="text-3">
<p>
This library provides a minimal implementation of ipe-sequences as arrays.
The goal is for the API to be sufficient for the needs of
MultiselectJS.
</p>
</div>

<div id="outline-container-org265ee92" class="outline-3">
<h3 id="org265ee92"><span class="section-number-3">3.1</span> Encoding and decoding ipe binary arrays</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The following two functions handle
the encoding and decoding of ipe-sequences.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org4ea870c">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_encode</span>(<span style="color: #BA36A5;">arr</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = <span style="color: #8b1a1a;">false</span>, <span style="color: #BA36A5;">seq</span> = [];
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>;
    <span style="color: #0000FF;">for</span> (i = 0; i &lt; arr.length; ++i) {
      <span style="color: #0000FF;">if</span> (arr[i] !== s) { seq.push(i); s = !s; }
    }
    <span style="color: #0000FF;">if</span> (s) seq.push(i);
    <span style="color: #0000FF;">return</span> seq;
  }
</pre>
</div>

<ul class="org-ul">
<li><code>arr</code> is an array of <code>bool</code> values.</li>
<li>Returns an inversion point encoded sequence of <code>arr</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js" id="orge0168a8">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_decode</span>(<span style="color: #BA36A5;">seq</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">arr</span> = []; 
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pind</span> = 0;
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; seq.length; ++i) {
      push_n(arr, s, seq[i] - pind);
      pind = seq[i];
      s = !s;
    }
    <span style="color: #0000FF;">return</span> arr;
  }
</pre>
</div>

<ul class="org-ul">
<li><code>seq</code> is an inversion point encoded sequence.</li>
<li>Returns the shortest binary array whose inversion point encoding is
<code>seq</code>.  The requirement for the shortest array means that there are
no zero-element runs.</li>
</ul>
</div>
</div>

<div id="outline-container-org00b069c" class="outline-3">
<h3 id="org00b069c"><span class="section-number-3">3.2</span> Constructing special ipe-sequences</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Construct an array with a single block of 1s:
</p>

<div class="org-src-container">
<pre class="src src-js" id="org74b9fed">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_encode_range</span>(<span style="color: #BA36A5;">b</span>, <span style="color: #BA36A5;">e</span>) { <span style="color: #0000FF;">return</span> [b, e]; }
</pre>
</div>

<ul class="org-ul">
<li><code>b</code> is the first index of the run</li>
<li><code>e</code> is one past the last index of the run</li>
</ul>
</div>
</div>
