org/ipe.org
** Applying a unary logical operation to an ipe-sequence within a mask

The function ~ipe_mask(mask, op, seq)~ returns the result of applying
the unary logical operation ~op~ to the elements of an ipe-sequence
~seq~, but only to those indices where ~mask~ is 1.

#+NAME: ipe-mask
#+BEGIN_SRC js
  function ipe_mask(mask, op, seq) {

    var op2 = (mv, av) => mv ? op(av) : av;
    var s = false, sm = false, sa = false;

    var arr = [];
    var a = 0, m = 0, p;

    while (m < mask.length && a < seq.length) {
      p = Math.min(mask[m], seq[a]);

      if (p === mask[m]) { sm = !sm; ++m; }
      if (p === seq[a]) { sa = !sa; ++a; }

      if (s != op2(sm, sa)) { s = !s; arr.push(p); }      
    }
    while (a < seq.length) { arr.push(seq[a]); ++a; }
    if (op(false)) { while (m < mask.length) { arr.push(mask[m]); ++m; } }
   
    return arr;
  }
#+END_SRC

- ~mask~ and ~seq~ are ipe-sequences.
- ~op~ is a function of type ~bool -> bool~.
- Let ~m = ipe_decode(mask)~ and ~a = ipe_decode(seq)~.
- Let ~me~ be ~m~ extended with ~false~ values at the end so that its
  length is ~max(m.length, a.length)~.
- Let ~ae~ be ~a~ extended with ~false~ values at the end so that its
  length is ~max(m.length, a.length)~.
- The return value is ~ipe_encode(r)~, where ~r~ is an array
  whose elements are ~r[i] = me[i] ? op(ae[i]) : ae[i]~.

A diff between two ipe-sequences can be computed using ~ipe_mask~:

#+NAME: ipe-diff
#+BEGIN_SRC js
  function ipe_diff(seq_a, seq_b) {
    return ipe_mask(seq_a, b => !b, seq_b);
  }
#+END_SRC

- ~mask~ and ~seq~ are ipe-sequences.
- The return value is an ipe-sequence.

The ~ipe_mask~ and ~ipe_diff~ functions are sufficient for all
manipulation of binary sequenes encountered with in the MultiselectJS
library. They maintain the invariant that binary sequences contain
a finite number of 1s. Arbitrary logical operations do not
maintain this invariant.

#+NAME: ipe-mask-and-diff-test
#+BEGIN_SRC js :exports none
  QUnit.test( "ipe_mask_tests", function( assert ) {
    var enc = ipe_encode, dec = ipe_decode, rm = ipe_mask;
    var f = false, t = true;

    var ff = function (x) { return f; };
    var tt = function (x) { return t; };
    var neg = function (x) { return !x; };
    var id = function (x) { return x; };

    assert.deepEqual(enc([t, t, f, f]), [0, 2]);    
    assert.deepEqual(enc([t, t, f, f, t]), [0, 2, 4, 5]);    
    assert.deepEqual(enc([t, t, t]), [0, 3]);
    assert.deepEqual(enc([f, t, f]), [1, 2]);
    assert.deepEqual((rm(enc([f, t, f]), neg, enc([t, t, t]))), [0, 1, 2, 3], "1");
    assert.deepEqual(dec(rm(enc([f, f, f]), neg, enc([t, t, t]))), [t, t, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), neg, enc([t, t, t]))), []);
    assert.deepEqual(dec(rm(enc([t, f, f]), neg, enc([t, t, t]))), [f, t, t]);

    assert.deepEqual(dec(rm(enc([f, f, f]), id, enc([t, t, f]))), [t, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), id, enc([t, t, f]))), [t, t]);
    assert.deepEqual(dec(rm(enc([t, f, f]), id, enc([t, t, f]))), [t, t]);

    assert.deepEqual(dec(rm(enc([f, f, f]), tt, enc([f, t, f]))), [f, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), tt, enc([f, t, f]))), [t, t, t]);
    assert.deepEqual(dec(rm(enc([t, f, f]), tt, enc([f, t, f]))), [t, t]);

    assert.deepEqual(dec(rm(enc([f, f, f]), ff, enc([t, t, t]))), [t, t, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), ff, enc([t, t, t]))), []);
    assert.deepEqual(dec(rm(enc([t, f, f]), ff, enc([t, t, t]))), [f, t, t]);
  });

  QUnit.test( "ipe_diff_tests", function( assert ) {
    var enc = ipe_encode, dec = ipe_decode, rm = ipe_diff;
    var f = false, t = true;

    assert.deepEqual(dec(rm(enc([f, f, f]), enc([t, t, t]))), [t, t, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), enc([t, t, t]))), []);
    assert.deepEqual(dec(rm(enc([t, f, f]), enc([t, t, t]))), [f, t, t]);
    assert.deepEqual(dec(rm(enc([t, t, t]), enc([f, t, f]))), [t, f, t]);
  });
#+END_SRC

** Retrieving an element in an ipe-sequence

#+NAME: ipe-at
#+BEGIN_SRC js
  function ipe_at(seq, i) {
    var j = array_upper_bound(seq, i);
    return !(j%2 === 0);
  }
#+END_SRC

- ~seq~ is an ipe-sequence.
- Return value is equivalent with ~ipe_decode(seq)[i]~. 

#+NAME: ipe-at-test
#+BEGIN_SRC js :exports none
  QUnit.test( "ipe_at", function( assert ) {
    assert.equal(ipe_at([], 0), false, "");
    assert.equal(ipe_at([], 3), false, "");

    assert.equal(ipe_at([1, 2, 3, 4], 0), false, "");
    assert.equal(ipe_at([1, 2, 3, 4], 1), true, "");
    assert.equal(ipe_at([1, 2, 3, 4], 2), false, "");
    assert.equal(ipe_at([1, 2, 3, 4], 3), true, "");
    assert.equal(ipe_at([1, 2, 3, 4], 4), false, "");
    assert.equal(ipe_at([1, 2, 3, 4], 5), false, "");
  });
#+END_SRC

* Tangle                                                           :noexport:

#+NAME: ipe-all
#+BEGIN_SRC js :noweb yes :padline no
<<utilities>>
<<ipe-encode>>
<<ipe-decode>>
<<ipe-encode-range>>
<<ipe-at>>
<<ipe-mask>>
<<ipe-diff>>

<<ipe-storage>>
<<ipe-ordered-geometry>>
#+END_SRC

#+BEGIN_SRC js :exports none :tangle ../js/ipe_storage.js :noweb yes :padline no
var multiselect = require('./multiselect.js');
<<ipe-all>>
<<ipe-exports>>
#+END_SRC
** Tests

#+BEGIN_SRC html :exports none :tangle ../test/ipetests.html :noweb yes :padline no 
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>Ipe Tests</title>
  <link rel="stylesheet" href="http://code.jquery.com/qunit/qunit-1.18.0.css">
</head>
<body>
  <div id="qunit"></div>
  <div id="qunit-fixture"></div>
  <script type="text/javascript" src="../dist/multiselect.js"></script>
  <script type="text/javascript" src="https://code.jquery.com/qunit/qunit-1.18.0.js"></script>
  <script type="text/javascript" src="./ipetests.js"></script>
</body>
</html>
#+END_SRC

#+BEGIN_SRC js :exports none :tangle ../test/ipetests.js :noweb yes :padline no 
  var test = QUnit.test;
  
  <<ipe-all>>

  <<array-lower-bound-test>>
  <<array-upper-bound-test>>

  <<ipe-encode-decode-test>>

  <<ipe-unary-op-test>>
  <<ipe-binary-op-test>>
  <<ipe-mask-and-diff-test>>
  <<ipe-at-test>>

  <<ipe-storage-test>>

  <<ipe-oredered-geometry-test>>
#+END_SRC

