org/ipe.html

<div id="outline-container-orgc0be15e" class="outline-3">
<h3 id="orgc0be15e"><span class="section-number-3">3.3</span> Applying a unary logical operation to an ipe-sequence within a mask</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The function <code>ipe_mask(mask, op, seq)</code> returns the result of applying
the unary logical operation <code>op</code> to the elements of an ipe-sequence
<code>seq</code>, but only to those indices where <code>mask</code> is 1.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgea6bd47">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_mask</span>(<span style="color: #BA36A5;">mask</span>, <span style="color: #BA36A5;">op</span>, <span style="color: #BA36A5;">seq</span>) {

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op2</span> = (mv, av) =&gt; mv ? op(av) : av;
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = <span style="color: #8b1a1a;">false</span>, <span style="color: #BA36A5;">sm</span> = <span style="color: #8b1a1a;">false</span>, <span style="color: #BA36A5;">sa</span> = <span style="color: #8b1a1a;">false</span>;

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">arr</span> = [];
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">a</span> = 0, <span style="color: #BA36A5;">m</span> = 0, <span style="color: #BA36A5;">p</span>;

    <span style="color: #0000FF;">while</span> (m &lt; mask.length &amp;&amp; a &lt; seq.length) {
      p = Math.min(mask[m], seq[a]);

      <span style="color: #0000FF;">if</span> (p === mask[m]) { sm = !sm; ++m; }
      <span style="color: #0000FF;">if</span> (p === seq[a]) { sa = !sa; ++a; }

      <span style="color: #0000FF;">if</span> (s != op2(sm, sa)) { s = !s; arr.push(p); }      
    }
    <span style="color: #0000FF;">while</span> (a &lt; seq.length) { arr.push(seq[a]); ++a; }
    <span style="color: #0000FF;">if</span> (op(<span style="color: #8b1a1a;">false</span>)) { <span style="color: #0000FF;">while</span> (m &lt; mask.length) { arr.push(mask[m]); ++m; } }
   
    <span style="color: #0000FF;">return</span> arr;
  }
</pre>
</div>

<ul class="org-ul">
<li><code>mask</code> and <code>seq</code> are ipe-sequences.</li>
<li><code>op</code> is a function of type <code>bool -&gt; bool</code>.</li>
<li>Let <code>m = ipe_decode(mask)</code> and <code>a = ipe_decode(seq)</code>.</li>
<li>Let <code>me</code> be <code>m</code> extended with <code>false</code> values at the end so that its
length is <code>max(m.length, a.length)</code>.</li>
<li>Let <code>ae</code> be <code>a</code> extended with <code>false</code> values at the end so that its
length is <code>max(m.length, a.length)</code>.</li>
<li>The return value is <code>ipe_encode(r)</code>, where <code>r</code> is an array
whose elements are <code>r[i] = me[i] ? op(ae[i]) : ae[i]</code>.</li>
</ul>

<p>
A diff between two ipe-sequences can be computed using <code>ipe_mask</code>:
</p>

<div class="org-src-container">
<pre class="src src-js" id="orge3b7619">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_diff</span>(<span style="color: #BA36A5;">seq_a</span>, <span style="color: #BA36A5;">seq_b</span>) {
    <span style="color: #0000FF;">return</span> ipe_mask(seq_a, b =&gt; !b, seq_b);
  }
</pre>
</div>

<ul class="org-ul">
<li><code>mask</code> and <code>seq</code> are ipe-sequences.</li>
<li>The return value is an ipe-sequence.</li>
</ul>

<p>
The <code>ipe_mask</code> and <code>ipe_diff</code> functions are sufficient for all
manipulation of binary sequenes encountered with in the MultiselectJS
library. They maintain the invariant that binary sequences contain
a finite number of 1s. Arbitrary logical operations do not
maintain this invariant.
</p>
</div>
</div>

<div id="outline-container-orgdd9332f" class="outline-3">
<h3 id="orgdd9332f"><span class="section-number-3">3.4</span> Retrieving an element in an ipe-sequence</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-js" id="org6e56639">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ipe_at</span>(<span style="color: #BA36A5;">seq</span>, <span style="color: #BA36A5;">i</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">j</span> = array_upper_bound(seq, i);
    <span style="color: #0000FF;">return</span> !(j%2 === 0);
  }
</pre>
</div>

<ul class="org-ul">
<li><code>seq</code> is an ipe-sequence.</li>
<li>Return value is equivalent with <code>ipe_decode(seq)[i]</code>.</li>
</ul>
</div>
</div>
</div>
