org/ipe.org
* Selection Storage with Ipe Binary Arrays

The ~IpeStorage~ class implements {{{msjs}}}'s Selection Storage API.

#+NAME: ipe-storage
#+BEGIN_SRC js
  function IpeStorage () {
    this._ops = [];
    this._domain = [];
    this._base = [];
  }
  
  IpeStorage.prototype.at = function(i) { return ipe_at(this._domain, i); };

  IpeStorage.prototype.selected = function() { return this._domain; };

  IpeStorage.prototype.push = function (op, changed) {
    if (changed!==undefined) { throw "Change tracking not supported"; }
    var masked_old = ipe_mask(op.domain, (b => b), this._domain);
    var new_domain = ipe_mask(op.domain, op.f, this._domain);
//    var masked_new = ipe_mask(op.domain, (b => b), new_domain); 
//    var diff = ipe_diff(masked_old, masked_new);
    var diff = ipe_diff(masked_old, new_domain);
    op.diff = diff;
    this._domain = new_domain;
    this._ops.push(op);
    if (changed) { 
    }
  };
  IpeStorage.prototype.pop = function(changed) {
    if (changed!==undefined) { throw "Change tracking not supported"; }
    var op = this._ops.pop();
    this._domain = ipe_mask(op.diff, (b => !b), this._domain);
    return op;
  };
  IpeStorage.prototype.top = function () { return this._ops[this._ops.length - 1]; };
  IpeStorage.prototype.top2 = function () { return this._ops[this._ops.length - 2]; }
  IpeStorage.prototype.size = function () { return this._ops.length; };
  IpeStorage.prototype.bake = function () { return this._ops.shift(); };
  IpeStorage.prototype.onSelected = function (J) { 
    return J.length === 2 && J[0] + 1 === J[1] && this.at(J[0]) === true;
    // J must indicate only one element, and that element must be currently selected
  };
  IpeStorage.prototype.modifyStorage = function (cmd) {} // all commands are a noop
  IpeStorage.prototype.equalDomains = function (J1, J2) { 
    if (J1.length !== J2.length) return false;
    for (var i=0; i<J1.length; ++i) if (J1[i] !== J2[i]) return false;
    return true;    
  }
  IpeStorage.prototype.isEmpty = function (J) { J.length === 0; }
#+END_SRC

#+NAME: ipe-storage-test
#+BEGIN_SRC js :exports none
  QUnit.test( "ipe_storage test", function( assert ) {
    var ops = new IpeStorage();

    function makeIpeOp (f, domain) {
      return { f: f, domain: domain };
    }

    assert.deepEqual(ops.selected(), [], "ipe_op_comp 1");
    ops.push(makeIpeOp(b => b, [2, 4]));
    assert.deepEqual(ops.selected(), []);
    ops.push(makeIpeOp(b => !b, [2, 4]));
    assert.deepEqual(ops.selected(), [2, 4]);
    assert.equal(ops.at(1), false);
    assert.equal(ops.at(2), true);
    assert.equal(ops.at(3), true);
    assert.equal(ops.at(4), false);
    assert.equal(ops.at(5), false);
    ops.push(makeIpeOp(b => true, [4, 6]));
    assert.deepEqual(ops.selected(), [2, 6]);
    ops.push(makeIpeOp(b => false, [3, 4]));
    assert.deepEqual(ops.selected(), [2, 3, 4, 6]);

    ops.pop();
    assert.deepEqual(ops.selected(), [2, 6]);
    ops.pop();
    assert.deepEqual(ops.selected(), [2, 4]);
    ops.pop();
    assert.deepEqual(ops.selected(), []);
    ops.pop();
    assert.deepEqual(ops.selected(), []);
    assert.equal(ops.size(), 0, "size test");
  });

  QUnit.test( "ipe_storage selection state test", function( assert ) {
    var ops = new IpeStorage();
    var sel = new multiselect.SelectionState(new IpeOrderedGeometry(10),
                                             undefined,
                                             false,
                                             10,
                                             new IpeStorage());
    sel.click(3);
    sel.shiftClick(6);
    assert.deepEqual(sel.selected(), [3, 7]);
    sel.cmdClick(1);
    assert.deepEqual(sel.selected(), [1, 2, 3, 7]);
    sel.cmdClick(5);
    assert.deepEqual(sel.selected(), [1, 2, 3, 5, 6, 7]);
    sel.shiftClick(4);
    assert.deepEqual(sel.selected(), [1, 2, 3, 4, 6, 7]);
  });
  
                                 
                                 
#+END_SRC

# FIXME Add tests for equalDomains etc.

