org/ipe.html

<div id="outline-container-orge8c40f7" class="outline-2">
<h2 id="orge8c40f7"><span class="section-number-2">4</span> Selection Storage with Ipe Binary Arrays</h2>
<div class="outline-text-2" id="text-4">
<p>
The <code>IpeStorage</code> class implements MultiselectJS&rsquo;s Selection Storage API.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org4d3dc88">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">IpeStorage</span> () {
    <span style="color: #8b1a1a;">this</span>._ops = [];
    <span style="color: #8b1a1a;">this</span>._domain = [];
    <span style="color: #8b1a1a;">this</span>._base = [];
  }
  
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.at = <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">i</span>) { <span style="color: #0000FF;">return</span> ipe_at(<span style="color: #8b1a1a;">this</span>._domain, i); };

  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.selected = <span style="color: #0000FF;">function</span>() { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._domain; };

  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.push = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">op</span>, <span style="color: #BA36A5;">changed</span>) {
    <span style="color: #0000FF;">if</span> (changed!==<span style="color: #8b1a1a;">undefined</span>) { <span style="color: #0000FF;">throw</span> <span style="color: #008000;">"Change tracking not supported"</span>; }
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">masked_old</span> = ipe_mask(op.domain, (b =&gt; b), <span style="color: #8b1a1a;">this</span>._domain);
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">new_domain</span> = ipe_mask(op.domain, op.f, <span style="color: #8b1a1a;">this</span>._domain);
<span style="color: #8D8D84;">//    </span><span style="color: #8D8D84; font-style: italic;">var masked_new = ipe_mask(op.domain, (b =&gt; b), new_domain); </span>
<span style="color: #8D8D84;">//    </span><span style="color: #8D8D84; font-style: italic;">var diff = ipe_diff(masked_old, masked_new);</span>
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">diff</span> = ipe_diff(masked_old, new_domain);
    op.diff = diff;
    <span style="color: #8b1a1a;">this</span>._domain = new_domain;
    <span style="color: #8b1a1a;">this</span>._ops.push(op);
    <span style="color: #0000FF;">if</span> (changed) { 
    }
  };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.pop = <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">changed</span>) {
    <span style="color: #0000FF;">if</span> (changed!==<span style="color: #8b1a1a;">undefined</span>) { <span style="color: #0000FF;">throw</span> <span style="color: #008000;">"Change tracking not supported"</span>; }
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = <span style="color: #8b1a1a;">this</span>._ops.pop();
    <span style="color: #8b1a1a;">this</span>._domain = ipe_mask(op.diff, (b =&gt; !b), <span style="color: #8b1a1a;">this</span>._domain);
    <span style="color: #0000FF;">return</span> op;
  };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.top = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops[<span style="color: #8b1a1a;">this</span>._ops.length - 1]; };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.top2 = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops[<span style="color: #8b1a1a;">this</span>._ops.length - 2]; }
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.size = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops.length; };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.bake = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops.shift(); };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.onSelected = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">J</span>) { 
    <span style="color: #0000FF;">return</span> J.length === 2 &amp;&amp; J[0] + 1 === J[1] &amp;&amp; <span style="color: #8b1a1a;">this</span>.at(J[0]) === <span style="color: #8b1a1a;">true</span>;
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">J must indicate only one element, and that element must be currently selected</span>
  };
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.modifyStorage = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">cmd</span>) {} <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">all commands are a noop</span>
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.equalDomains = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">J1</span>, <span style="color: #BA36A5;">J2</span>) { 
    <span style="color: #0000FF;">if</span> (J1.length !== J2.length) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>=0; i&lt;J1.length; ++i) <span style="color: #0000FF;">if</span> (J1[i] !== J2[i]) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">true</span>;    
  }
  IpeStorage.<span style="color: #8b1a1a;">prototype</span>.isEmpty = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">J</span>) { J.length === 0; }
</pre>
</div>
</div>
</div>
