org/ipe.org
* Example Selection Geometry

#+NAME: ipe-ordered-geometry
#+BEGIN_SRC js
// size is the number of elements
var IpeOrderedGeometry = function (size) {
  multiselect.DefaultGeometry.call(this);
  this._size = size;
};

IpeOrderedGeometry.prototype = Object.create(multiselect.DefaultGeometry.prototype);
IpeOrderedGeometry.prototype.constructor = IpeOrderedGeometry;

IpeOrderedGeometry.prototype.size = function() { return this._size; }

// retain only the anchor and the active end, ignore null points
IpeOrderedGeometry.prototype.extendPath = function(path, vp) {
  if (vp === null) return null;
  if (path.length === 2) path.pop();
  path.push(vp);
};

// selection domain is the range between anchor and active end 
IpeOrderedGeometry.prototype.selectionDomain = function (spath) {
  if (spath.length === 0) return ipe_encode([]);
  var b = Math.max(0, Math.min(spath[0], spath[spath.length-1]));
  var e = Math.min(this.size()-1, Math.max(spath[0], spath[spath.length-1]));
  return ipe_encode_range(b, e+1);
};

// iterate from 0 to size-1
IpeOrderedGeometry.prototype.filter = function (predicate) {
  var b = [];
  for (var i = 0; i < this.size(); ++i) b[i] = predicate(i);
  return ipe_encode(b);
};
#+END_SRC

#+NAME: ipe-exports
#+BEGIN_SRC js
exports.IpeStorage = IpeStorage;
exports.IpeOrderedGeometry = IpeOrderedGeometry;
#+END_SRC

#+NAME: ipe-oredered-geometry-test
#+BEGIN_SRC js
  QUnit.test( "ipe ordered geometry test", function( assert ) {
    var g = new IpeOrderedGeometry(10);

    assert.deepEqual(g.selectionDomain([3, 6]), [3, 7]);
    assert.deepEqual(g.selectionDomain([6, 3]), [3, 7]);
    assert.deepEqual(g.selectionDomain([6, 100, 22, 2, 3]), [3, 7]);
    assert.deepEqual(g.selectionDomain([]), []);

    assert.deepEqual(g.filter((i) => i == 7 || i == 8), [7, 9]);
  });
#+END_SRC

* File local variables                                     :ARCHIVE:noexport:
  
# Local Variables:
# mode: org
# org-html-postamble: nil
# org-babel-use-quick-and-dirty-noweb-expansion: t
# End:






#  LocalWords:  noexport msjs MultiselectJS Jaakko Järvi num toc todo
#  LocalWords:  LaTeX pri html postamble stylesheet css href DOCTYPE
#  LocalWords:  xhtml src overline monospace indexable multi GUIs dom
#  LocalWords:  newcommand mathsf selset mathbf inds subseteq mapsto
#  LocalWords:  notin indices ldots circ mathit selectionDomain FIXME
#  LocalWords:  EcmaScript js API nodejs makeEmptySet makeEmptyMap ok
#  LocalWords:  isEmpty isSingleton firstKey equalKeys setUnion noweb
#  LocalWords:  setSymmetricDifference nd bool tt constness fn func
#  LocalWords:  makeSelectionMapping multiselect arrayEquals makeOp
#  LocalWords:  makeOpComposition ith encodings eval cdots mathtt sel
#  LocalWords:  texttt bmap lastOp removeIndex SelectionState maxUndo
#  LocalWords:  coordinateSystem boolean maxOps undoable spath tuple
#  LocalWords:  redoStack addEmptyPair isSelected getter selectedMap
#  LocalWords:  cmdClick shiftClick ps vp pointToPath stripEmptyPair
#  LocalWords:  cmd onSelectedIndex tmp numberOfOps vps extendPath ss
#  LocalWords:  onSelected onElement emptyPairOnTop queuedCommand dir
#  LocalWords:  commandQueue opertationQueue scheduleKeepLast pred hs
#  LocalWords:  getters acquireCursor shiftSpace VerticalCS kbd dg 
#  LocalWords:  cmdSpace nop deepEqual DefaultGeometry mpoint typeof
#  LocalWords:  vpoint pre defaultPath subsequence activeEnd keypress
#  LocalWords:  defaultCursor upto boundToElement resizing init undos
#  LocalWords:  redostack setTimeout setProperty namespace padline
#  LocalWords:  charset utf qunit QUnit reposition args stateful oldJ
