org/ipe.html

<div id="outline-container-org425da7c" class="outline-2">
<h2 id="org425da7c"><span class="section-number-2">5</span> Example Selection Geometry</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-js" id="orgc9052df"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">size is the number of elements</span>
<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">IpeOrderedGeometry</span> = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">size</span>) {
  multiselect.DefaultGeometry.call(<span style="color: #8b1a1a;">this</span>);
  <span style="color: #8b1a1a;">this</span>._size = size;
};

IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span> = Object.create(multiselect.DefaultGeometry.<span style="color: #8b1a1a;">prototype</span>);
IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span>.constructor = IpeOrderedGeometry;

IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span>.size = <span style="color: #0000FF;">function</span>() { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._size; }

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">retain only the anchor and the active end, ignore null points</span>
IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span>.extendPath = <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">path</span>, <span style="color: #BA36A5;">vp</span>) {
  <span style="color: #0000FF;">if</span> (vp === <span style="color: #8b1a1a;">null</span>) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">null</span>;
  <span style="color: #0000FF;">if</span> (path.length === 2) path.pop();
  path.push(vp);
};

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">selection domain is the range between anchor and active end </span>
IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span>.selectionDomain = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">spath</span>) {
  <span style="color: #0000FF;">if</span> (spath.length === 0) <span style="color: #0000FF;">return</span> ipe_encode([]);
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">b</span> = Math.max(0, Math.min(spath[0], spath[spath.length-1]));
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">e</span> = Math.min(<span style="color: #8b1a1a;">this</span>.size()-1, Math.max(spath[0], spath[spath.length-1]));
  <span style="color: #0000FF;">return</span> ipe_encode_range(b, e+1);
};

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">iterate from 0 to size-1</span>
IpeOrderedGeometry.<span style="color: #8b1a1a;">prototype</span>.filter = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">predicate</span>) {
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">b</span> = [];
  <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; <span style="color: #8b1a1a;">this</span>.size(); ++i) b[i] = predicate(i);
  <span style="color: #0000FF;">return</span> ipe_encode(b);
};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js" id="org08c6ab5">exports.IpeStorage = IpeStorage;
exports.IpeOrderedGeometry = IpeOrderedGeometry;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js" id="org7322d93">  QUnit.test( <span style="color: #008000;">"ipe ordered geometry test"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">assert</span> ) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">g</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">IpeOrderedGeometry</span>(10);

    assert.deepEqual(g.selectionDomain([3, 6]), [3, 7]);
    assert.deepEqual(g.selectionDomain([6, 3]), [3, 7]);
    assert.deepEqual(g.selectionDomain([6, 100, 22, 2, 3]), [3, 7]);
    assert.deepEqual(g.selectionDomain([]), []);

    assert.deepEqual(g.filter((i) =&gt; i == 7 || i == 8), [7, 9]);
  });
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
